### List of Changed Stacks

```bash
stacks/client-1
stacks/modules
exitcode=0
stdout<<EOF
stacks/client-1
stacks/modules
EOF
stderr<<EOF
EOF
```

#### Terraform Plan

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.master-module.aws_instance.master_instance will be created
  + resource "aws_instance" "master_instance" {
      + ami                                  = "ami-07caf09b362be10b8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-066d0bddfd2c1c8ce"
      + tags                                 = {
          + "Client" = "client-1"
          + "Name"   = "client-1_master_instance"
        }
      + tags_all                             = {
          + "Client" = "client-1"
          + "Name"   = "client-1_master_instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # module.master-module.aws_subnet.master_public_subnet will be updated in-place
  ~ resource "aws_subnet" "master_public_subnet" {
        id                                             = "subnet-066d0bddfd2c1c8ce"
      ~ tags                                           = {
          ~ "Client" = "Azamon" -> "client-1"
          ~ "Name"   = "Azamon_master_subnet" -> "client-1_master_subnet"
        }
      ~ tags_all                                       = {
          ~ "Client" = "Azamon" -> "client-1"
          ~ "Name"   = "Azamon_master_subnet" -> "client-1_master_subnet"
        }
        # (15 unchanged attributes hidden)
    }

  # module.master-module.aws_vpc_security_group_egress_rule.allow_slave_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "allow_slave_egress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # module.master-module.aws_vpc_security_group_ingress_rule.allow_internet_traffic_global will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_internet_traffic_global" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # module.master-module.aws_vpc_security_group_ingress_rule.allow_slave_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_slave_ingress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # module.sg.aws_security_group.master_sg will be created
  + resource "aws_security_group" "master_sg" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic and all outbound traffic to the master of client-1"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "client-1_master_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Client" = "client-1"
          + "Name"   = "client-1_master_sg"
        }
      + tags_all               = {
          + "Client" = "client-1"
          + "Name"   = "client-1_master_sg"
        }
      + vpc_id                 = "vpc-08c07fc88ec42d090"
    }

  # module.sg.aws_security_group.slave_sg will be created
  + resource "aws_security_group" "slave_sg" {
      + arn                    = (known after apply)
      + description            = "Segurity group for the slave structure of the client client-1"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "client-1_slave_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Client" = "client-1"
          + "Name"   = "client-1_slave_sg"
        }
      + tags_all               = {
          + "Client" = "client-1"
          + "Name"   = "client-1_slave_sg"
        }
      + vpc_id                 = "vpc-08c07fc88ec42d090"
    }

  # module.slave-module.aws_autoscaling_group.slave_asg must be replaced
-/+ resource "aws_autoscaling_group" "slave_asg" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:295093822487:autoScalingGroup:4bc5f1c8-6f86-46dd-a6f8-afa4d6558ccc:autoScalingGroupName/Azamon_asg" -> (known after apply)
      - capacity_rebalance               = false -> null
      ~ default_cooldown                 = 300 -> (known after apply)
      - default_instance_warmup          = 0 -> null
      ~ desired_capacity                 = 0 -> 3
      - enabled_metrics                  = [] -> null
      ~ health_check_type                = "EC2" -> (known after apply)
      ~ id                               = "Azamon_asg" -> (known after apply)
      ~ load_balancers                   = [] -> (known after apply)
      - max_instance_lifetime            = 0 -> null
      ~ min_size                         = 0 -> 2
      ~ name                             = "Azamon_asg" -> "client-1_asg" # forces replacement
      + name_prefix                      = (known after apply)
      ~ predicted_capacity               = 0 -> (known after apply)
      ~ service_linked_role_arn          = "arn:aws:iam::295093822487:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes              = [] -> null
      ~ target_group_arns                = [] -> (known after apply)
      - termination_policies             = [] -> null
      ~ vpc_zone_identifier              = [] -> (known after apply)
      ~ warm_pool_size                   = 0 -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ launch_template {
          ~ id      = "lt-0ce74ba34c66d7ae8" -> (known after apply)
          ~ name    = "Azamon_template20240508223042016500000001" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.slave-module.aws_launch_template.slave_launch_template must be replaced
-/+ resource "aws_launch_template" "slave_launch_template" {
      ~ arn                     = "arn:aws:ec2:us-east-1:295093822487:launch-template/lt-0ce74ba34c66d7ae8" -> (known after apply)
      ~ default_version         = 1 -> (known after apply)
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      ~ id                      = "lt-0ce74ba34c66d7ae8" -> (known after apply)
      ~ latest_version          = 1 -> (known after apply)
      ~ name                    = "Azamon_template20240508223042016500000001" -> (known after apply)
      ~ name_prefix             = "Azamon_template" -> "client-1_template" # forces replacement
      - security_group_names    = [] -> null
      - tags                    = {} -> null
      ~ tags_all                = {} -> (known after apply)
      ~ vpc_security_group_ids  = [
          - "sg-02515aaf051c9efa6",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ tag_specifications {
          ~ tags          = {
              + "Client" = "client-1"
              ~ "Name"   = "Azamon" -> "client-1"
            }
            # (1 unchanged attribute hidden)
        }
    }

  # module.slave-module.aws_subnet.slave_public_subnet will be updated in-place
  ~ resource "aws_subnet" "slave_public_subnet" {
        id                                             = "subnet-05624ae6f2cb7dc2a"
      ~ tags                                           = {
          ~ "Client" = "Azamon" -> "client-1"
          ~ "Name"   = "Azamon_slave_subnet" -> "client-1_slave_subnet"
        }
      ~ tags_all                                       = {
          ~ "Client" = "Azamon" -> "client-1"
          ~ "Name"   = "Azamon_slave_subnet" -> "client-1_slave_subnet"
        }
        # (15 unchanged attributes hidden)
    }

  # module.slave-module.aws_vpc_security_group_egress_rule.egress_from_master_sg will be created
  + resource "aws_vpc_security_group_egress_rule" "egress_from_master_sg" {
      + arn                          = (known after apply)
      + description                  = "Egress rule that allow the slave to communicate with the master instance"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # module.slave-module.aws_vpc_security_group_ingress_rule.ingress_from_master_sg will be created
  + resource "aws_vpc_security_group_ingress_rule" "ingress_from_master_sg" {
      + arn                          = (known after apply)
      + description                  = "Ingress rule that allow the slave to communicate with the master instance"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

Plan: 10 to add, 2 to change, 2 to destroy.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.master-module.aws_instance.master_instance will be created
  + resource "aws_instance" "master_instance" {
      + ami                                  = "ami-07caf09b362be10b8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-066d0bddfd2c1c8ce"
      + tags                                 = {
          + "Client" = "Azamon"
          + "Name"   = "Azamon_master_instance"
        }
      + tags_all                             = {
          + "Client" = "Azamon"
          + "Name"   = "Azamon_master_instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # module.master-module.aws_vpc_security_group_egress_rule.allow_slave_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "allow_slave_egress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # module.master-module.aws_vpc_security_group_ingress_rule.allow_internet_traffic_global will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_internet_traffic_global" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # module.master-module.aws_vpc_security_group_ingress_rule.allow_slave_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_slave_ingress" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # module.sg.aws_security_group.master_sg will be created
  + resource "aws_security_group" "master_sg" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic and all outbound traffic to the master of Azamon"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Azamon_master_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Client" = "Azamon"
          + "Name"   = "Azamon_master_sg"
        }
      + tags_all               = {
          + "Client" = "Azamon"
          + "Name"   = "Azamon_master_sg"
        }
      + vpc_id                 = "vpc-08c07fc88ec42d090"
    }

  # module.sg.aws_security_group.slave_sg will be created
  + resource "aws_security_group" "slave_sg" {
      + arn                    = (known after apply)
      + description            = "Segurity group for the slave structure of the client Azamon"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Azamon_slave_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Client" = "Azamon"
          + "Name"   = "Azamon_slave_sg"
        }
      + tags_all               = {
          + "Client" = "Azamon"
          + "Name"   = "Azamon_slave_sg"
        }
      + vpc_id                 = "vpc-08c07fc88ec42d090"
    }

  # module.slave-module.aws_autoscaling_group.slave_asg will be updated in-place
  ~ resource "aws_autoscaling_group" "slave_asg" {
      ~ desired_capacity                 = 0 -> 3
        id                               = "Azamon_asg"
      ~ min_size                         = 0 -> 2
        name                             = "Azamon_asg"
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.slave-module.aws_launch_template.slave_launch_template will be updated in-place
  ~ resource "aws_launch_template" "slave_launch_template" {
        id                      = "lt-0ce74ba34c66d7ae8"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "Azamon_template20240508223042016500000001"
        tags                    = {}
      ~ vpc_security_group_ids  = [
          - "sg-02515aaf051c9efa6",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ tag_specifications {
          ~ tags          = {
              + "Client" = "Azamon"
                "Name"   = "Azamon"
            }
            # (1 unchanged attribute hidden)
        }
    }

  # module.slave-module.aws_vpc_security_group_egress_rule.egress_from_master_sg will be created
  + resource "aws_vpc_security_group_egress_rule" "egress_from_master_sg" {
      + arn                          = (known after apply)
      + description                  = "Egress rule that allow the slave to communicate with the master instance"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

  # module.slave-module.aws_vpc_security_group_ingress_rule.ingress_from_master_sg will be created
  + resource "aws_vpc_security_group_ingress_rule" "ingress_from_master_sg" {
      + arn                          = (known after apply)
      + description                  = "Ingress rule that allow the slave to communicate with the master instance"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
    }

Plan: 8 to add, 2 to change, 0 to destroy.
```

<!-- Sticky Pull Request Commentterraform-plan -->